<a href="https://colab.research.google.com/github/souviksaha97/tensorflow-udemy/blob/main/Pandas_Revision.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
labels = ['a', 'b', 'c']

mylist = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [ ]:
pd.Series(data=mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
salesQ1 = pd.Series(data=[250, 450, 200, 150], index=['USA', 'China', 'India', 'Brazil'])

In [ ]:
salesQ2 = pd.Series(data=[300, 250, 200, 150], index=['USA', 'China', 'India', 'Japan'])

In [ ]:
salesQ2['China']

250

In [ ]:
salesQ1[2]

200

In [ ]:
salesQ1+salesQ2

Brazil      NaN
China     700.0
India     400.0
Japan       NaN
USA       550.0
dtype: float64

In [ ]:
columns = ['W', 'X', 'Y', 'Z']

In [ ]:
index = ['A', 'B', 'C', 'D', 'E']

In [ ]:
from numpy.random import randint

In [ ]:
np.random.seed(42)
data = randint(-100, 100, (5,4))

In [ ]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [ ]:
df = pd.DataFrame(data, index, columns)

In [ ]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [ ]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [ ]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [ ]:
df['W']['A']

2

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [ ]:
df.drop('new', axis=1, inplace=True)

In [ ]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [ ]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [ ]:
df.loc[['A', 'E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [ ]:
df.iloc[:2]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

In [ ]:
df.loc[['A', 'C'], ['W', 'Y']]

   W   Y
A  2  -8
C  2 -26

In [ ]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [ ]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [ ]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [ ]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [ ]:
df[df['X']>0]['X']

A    79
C    21
E    49
Name: X, dtype: int64

In [ ]:
df[df['X']>0]['X'].loc['A']

79

In [ ]:
df[(df['W']>0) & (df['Y']>1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [ ]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [ ]:
new_index = ['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df['States'] = new_index

In [ ]:
df = df.set_index('States')

In [ ]:
df['X']

States
CA    79
NY   -29
WY    21
OR    -1
CO    49
Name: X, dtype: int64

In [ ]:
df.loc['CA']

W     2
X    79
Y    -8
Z   -86
Name: CA, dtype: int64

In [ ]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 360.0+ bytes

In [ ]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

In [ ]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [ ]:
df1 = pd.DataFrame({'A':[1,2, np.nan, 4],
                    'B':[5, np.nan, np.nan, 8],
                    'C':[10, 20, 30, 40]})

In [ ]:
df1

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
df1.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [ ]:
df1.fillna(value='FILL VALUE')

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [ ]:
df1.fillna(0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [ ]:
df1['A'].fillna(0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [ ]:
df1['B'].fillna(df1['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [ ]:
df1.fillna(df1.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [ ]:
from google.colab import files
uploaded  = files.upload()

In [ ]:
df = pd.read_csv('Universities.csv')
df.head()

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [ ]:
df.groupby('Year').sum()

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [ ]:
df.groupby('Year').mean()

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [ ]:
df.groupby('Year').sum().sort_index(ascending=False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [ ]:
df.groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [ ]:
df.groupby(['Year', 'Completions']).sum()

                                                             Sector  ...     Geography
Year Completions                                                     ...
2012 13                        Private for-profit, less-than 2-year  ...        Nevada
     21                        Private for-profit, less-than 2-year  ...        Nevada
     51                         Private for-profit, 4-year or above  ...        Nevada
     75                                  Private for-profit, 2-year  ...        Nevada
     78           Private for-profit, 2-yearPrivate for-profit, ...  ...  NevadaNevada
...                                                             ...  ...           ...
2016 960                                    Public, 4-year or above  ...        Nevada
     2431                                            Public, 2-year  ...        Nevada
     4309                                   Public, 4-year or above  ...        Nevada
     4763                                   Public, 4-year or above  ...        Nevada
     5367                                   Public, 4-year or above  ...        Nevada

[198 rows x 3 columns]

In [ ]:
df.groupby('Year').describe().transpose()

Year                      2012         2013  ...         2015         2016
Completions count    38.000000    40.000000  ...    44.000000    43.000000
            mean    535.078947   526.150000  ...   597.250000   609.860465
            std    1036.433239  1040.474782  ...  1183.371791  1235.952796
            min      13.000000     0.000000  ...     0.000000     0.000000
            25%     114.250000    98.500000  ...    87.750000    90.000000
            50%     229.500000   189.000000  ...   191.000000   208.000000
            75%     420.500000   413.000000  ...   405.750000   414.000000
            max    5388.000000  5278.000000  ...  5335.000000  5367.000000

[8 rows x 5 columns]

In [ ]:
df_one = pd.DataFrame({'k1':['A', 'A', 'B', 'B', 'C', 'C'],
                       'col1':[100, 200, 300, 300, 400, 500],
                       'col2':['NY', 'CA', 'WA', 'WA', 'AK', 'NV']})

In [ ]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [ ]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
df_one['NEW'] = df_one['col1'] * 10

In [ ]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [ ]:
def grab_first_letter(state):
  return state[0]

In [ ]:
grab_first_letter('NY')

'N'

In [ ]:
df_one['special'] = df_one['col2'].apply(grab_first_letter)

In [ ]:
df_one

  k1  col1 col2   NEW special
0  A   100   NY  1000       N
1  A   200   CA  2000       C
2  B   300   WA  3000       W
3  B   300   WA  3000       W
4  C   400   AK  4000       A
5  C   500   NV  5000       N

In [ ]:
def complex_letter(state):
  if state[0] == 'W':
    return 'Washington'
  else:
    return 'Error'

In [ ]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [ ]:
my_map = {'A':1, 'B':2, 'C':3}

In [ ]:
df_one['num'] = df_one['k1'].map(my_map)

In [ ]:
df_one

  k1  col1 col2   NEW special  num
0  A   100   NY  1000       N    1
1  A   200   CA  2000       C    1
2  B   300   WA  3000       W    2
3  B   300   WA  3000       W    2
4  C   400   AK  4000       A    3
5  C   500   NV  5000       N    3

In [ ]:
df_one.columns = ['C1', 'C2', 'C3', 'C4', 'C5', 'C6']

In [ ]:
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [ ]:
df_one.sort_values('C3', ascending=False)

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [ ]:
features = pd.DataFrame({'A':[100, 200, 300, 400, 500],
                         'B':[12, 13, 14, 15, 16]})

predictions = pd.DataFrame({'pred':[0, 1, 1, 0, 1]})

In [ ]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [ ]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [ ]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [ ]:
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [ ]:
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1